pascal-4.0/tutorials/surfaceTracking/interTrackFoam/tangSurfTenTest3D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

applicationClass    interTrackFoamUser;

startFrom           latestTime;

startTime           0;

stopAt              endTime;

endTime             1200.0;

deltaT              0.0001;

adjustTimeStep      yes;

maxCo               1;

maxDeltaT           0.1;

writeControl        adjustableRunTime;
// writeControl        timeStep;

writeInterval       0.1;
// writeInterval       1;

cycleWrite          0;

writeFormat         binary;

timeFormat          general;

timePrecision       6;

runTimeModifiable   yes;

functions
{
    cmean
    {
        functionObjectLibs
        (
            "libsimpleFunctionObjects.so"
        );

        type              patchAverage;

        enabled           true;

        outputControlMode outputTime;

        verbose           true;

        patches
        (
            trackedSurface
        );

        fields
        (
            c
        );
    }
}

// ************************************************************************* //

