pascal-4.0/tutorials/surfaceTracking/interTrackFoam/tangSurfTenTest3D/system/funkySetBoundaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      funkySetBoundaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

conc
{
    field                 c;

     // dc/dy = 25.4 mol/l/m = 25.4e+3 mol/m^4
    expressions
    (
        {
            target        value;
            patchName     "top";
            expression    "25.4e+3*(pos().y+0.004)";
        }
        {
            target        value;
            patchName     "bottom";
            expression    "25.4e+3*(pos().y+0.004)";
        }
    );
}

// ************************************************************************* //
